BW-Song/ESP32GetStarted/Device/.build/sketch/device.ino.cpp
#include <Arduino.h>
#line 1 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
#line 1 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
/**
 * A simple Azure IoT example for sending telemetry to Iot Hub.
 */

#include <WiFi.h>
#include "Esp32MQTTClient.h"
#include <DNSServer.h>
#include <WebServer.h>
#include <WiFiManager.h>
#include <Preferences.h>

#define INTERVAL 10000
#define MESSAGE_MAX_LEN 256

WiFiManager wifiManager;
char* connectionString;
Preferences preferences;
WiFiManagerParameter conStr("ConnectionString","ConnectionString",connectionString,40);

const char *messageData = "{\"messageId\":%d, \"Temperature\":%f, \"Humidity\":%f}";
static bool hasIoTHub = false;
static bool hasWifi = false;
int messageCount = 1;
static bool messageSending = true;
static uint64_t send_interval_ms;

#line 27 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
static void SendConfirmationCallback(IOTHUB_CLIENT_CONFIRMATION_RESULT result);
#line 35 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
static void MessageCallback(const char* payLoad, int size);
#line 41 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
static void DeviceTwinCallback(DEVICE_TWIN_UPDATE_STATE updateState, const unsigned char *payLoad, int size);
#line 55 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
static int DeviceMethodCallback(const char *methodName, const unsigned char *payload, int size, unsigned char **response, int *response_size);
#line 84 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
void saveConfigCallback();
#line 94 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
void setup();
#line 132 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
void loop();
#line 27 "c:\\Users\\t-bosong\\Documents\\GitHub\\ESP32GetStarted\\Device\\device.ino"
static void SendConfirmationCallback(IOTHUB_CLIENT_CONFIRMATION_RESULT result)
{
  if (result == IOTHUB_CLIENT_CONFIRMATION_OK)
  {
    Serial.println("Send Confirmation Callback finished.");
  }
}

static void MessageCallback(const char* payLoad, int size)
{
  Serial.println("Message callback:");
  Serial.println(payLoad);
}

static void DeviceTwinCallback(DEVICE_TWIN_UPDATE_STATE updateState, const unsigned char *payLoad, int size)
{
  char *temp = (char *)malloc(size + 1);
  if (temp == NULL)
  {
    return;
  }
  memcpy(temp, payLoad, size);
  temp[size] = '\0';
  // Display Twin message.
  Serial.println(temp);
  free(temp);
}

static int  DeviceMethodCallback(const char *methodName, const unsigned char *payload, int size, unsigned char **response, int *response_size)
{
  LogInfo("Try to invoke method %s", methodName);
  const char *responseMessage = "\"Successfully invoke device method\"";
  int result = 200;

  if (strcmp(methodName, "start") == 0)
  {
    LogInfo("Start sending temperature and humidity data");
    messageSending = true;
  }
  else if (strcmp(methodName, "stop") == 0)
  {
    LogInfo("Stop sending temperature and humidity data");
    messageSending = false;
  }
  else
  {
    LogInfo("No method %s found", methodName);
    responseMessage = "\"No method found\"";
    result = 404;
  }

  *response_size = strlen(responseMessage) + 1;
  *response = (unsigned char *)strdup(responseMessage);

  return result;
}

void saveConfigCallback()
{
  // Serial.println(wifiManager.getSSID());
  // Serial.println(wifiManager.getPassword());
  // Serial.println(conStr.getValue());
  preferences.putString("WiFi_SSID",wifiManager.getSSID());
  preferences.putString("WiFi_Password",wifiManager.getPassword());
  preferences.putString("ConStr",String(conStr.getValue()));
}

void setup() {
  Serial.begin(115200);
  Serial.println("ESP32 Device");
  Serial.println("Initializing...");

  Serial.println(" > WiFi");
  Serial.println("Starting connecting WiFi.");
  
  preferences.begin("Connections");
  wifiManager.resetSettings();
  wifiManager.setDebugOutput(false);
  wifiManager.addParameter(&conStr);
  wifiManager.setSaveParamsCallback(saveConfigCallback);
  wifiManager.autoConnect("ESP32-WiFiConfig", "AzureSet");
  preferences.end();
  hasWifi = true;
  
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
  Serial.println(" > IoT Hub");
  if (!Esp32MQTTClient_Init((const uint8_t*)connectionString, true))
  {
    hasIoTHub = false;
    Serial.println("Initializing IoT hub failed.");
    return;
  }
  hasIoTHub = true;
  Esp32MQTTClient_SetSendConfirmationCallback(SendConfirmationCallback);
  Esp32MQTTClient_SetMessageCallback(MessageCallback);
  Esp32MQTTClient_SetDeviceTwinCallback(DeviceTwinCallback);
  Esp32MQTTClient_SetDeviceMethodCallback(DeviceMethodCallback);
  Serial.println("Start sending events.");
  randomSeed(analogRead(0));
  send_interval_ms = millis();

}

void loop() {
if (hasWifi && hasIoTHub)
  {
    if (messageSending && 
        (int)(millis() - send_interval_ms) >= INTERVAL)
    {
      // Send teperature data
      char messagePayload[MESSAGE_MAX_LEN];
      float temperature = (float)random(0,500)/10;
      float humidity = (float)random(0, 1000)/10;
      snprintf(messagePayload, MESSAGE_MAX_LEN, messageData, messageCount++, temperature, humidity);
      Serial.println(messagePayload);
      EVENT_INSTANCE* message = Esp32MQTTClient_Event_Generate(messagePayload, MESSAGE);
      Esp32MQTTClient_SendEventInstance(message);
      send_interval_ms = millis();
    }
    else
    {
      Esp32MQTTClient_Check();
    }
  }
  delay(10);
}
